In [1]:
# #All step in build machine learning model:

# I. Collecting/gathering data
# Data usually in different format:
#1. Scrape from websites
#2. Conduct survey and interviews
#3. Data from given dataset

#II. Data preparation
# Merging or combining datasets or parts of it to form something coherent
# After that, we perform operations and transformations in it

#III. Data analytics
# Use data to analysis or build machine learning model

# This course we focus on the 2nd step, which is maybe most important: Data preparation

In [2]:
#Data wrangling: process of transform data from raw to another format, make it more valuable
# Concatenating datasets
# Your data can be broken chunks from multiple sources, so you need to concatenating (linking) them together

In [35]:
#import pandas
import pandas as pd
# creating a dummy dataframe

df1_dummy = {
    "serial_id" : ["1", "2", "3", "4", "5"],
    "sale_month" : ["Jan", "Feb", "Mar", "Apr", "May"],
    "sales" : ["12300", "25100", "17800", "20100", "21000"]
}
#create dateframe from dictionary df1_dummy
df1 = pd.DataFrame(df1_dummy, columns = ["serial_id", "sale_month", "sales"]) #you can change column names

df1

  serial_id sale_month  sales
0         1        Jan  12300
1         2        Feb  25100
2         3        Mar  17800
3         4        Apr  20100
4         5        May  21000

In [18]:
# use iloc to select rows in dataframe
df1.iloc[[0]]

  serial sale_month  sales
0    NaN        Jan  12300

In [21]:
# use [] to select column from dataframe
df1["sale_month"].iloc[1]

'Feb'

In [24]:
#create 2nd dummy table

df2_dummy = {
    "serial_id" : ["6", "7", "8", "9", "10"],
    "sale_month" : ["Jun", "Jul", "Aug", "Sep", "Oct"],
    "sales" : ["25000", "23700", "24600", "24000", "23950"]
}

df2 = pd.DataFrame(df2_dummy, columns = ["serial_id", "sale_month", "sales"])

In [25]:
df2

  serial_id sale_month  sales
0         6        Jun  25000
1         7        Jul  23700
2         8        Aug  24600
3         9        Sep  24000
4        10        Oct  23950

In [30]:
#create 3rd dummy table

df3_dummy = {
    "sales_threshold" : ["No", "Yes", "No", "Yes", "Yes", "Yes", "Yes", "Yes", "Yes", "Yes"],
    "bonus_threshold" : ["No", "Yes", "No", "No", "No", "Yes", "No", "Yes", "Yes", "No"]
}

df3 = pd.DataFrame(df3_dummy) #column names automatic assgin for dataframe

In [31]:
df3

  sales_threshold bonus_threshold
0              No              No
1             Yes             Yes
2              No              No
3             Yes              No
4             Yes              No
5             Yes             Yes
6             Yes              No
7             Yes             Yes
8             Yes             Yes
9             Yes              No

In [37]:
# concat the first and second dataframe together row_wise
df_row = pd.concat([df1, df2])
# You can only concate columns row-wise with same names

In [38]:
df_row #now 2 dataframe has been appended

  serial_id sale_month  sales
0         1        Jan  12300
1         2        Feb  25100
2         3        Mar  17800
3         4        Apr  20100
4         5        May  21000
0         6        Jun  25000
1         7        Jul  23700
2         8        Aug  24600
3         9        Sep  24000
4        10        Oct  23950

In [39]:
# concat df_row and 3rd dataframe column-wise
df_full = pd.concat([df_row, df3], axis = 1) #default is axis = 0, which means concat row-wise
df_full
# because the index in df_row is not unique, it can't concat with df3

InvalidIndexError: Reindexing only valid with uniquely valued Index objects

In [40]:
# to solve this, add an argument to ignore index
df_row = pd.concat([df1, df2], ignore_index = True)

In [42]:
df_row

  serial_id sale_month  sales
0         1        Jan  12300
1         2        Feb  25100
2         3        Mar  17800
3         4        Apr  20100
4         5        May  21000
5         6        Jun  25000
6         7        Jul  23700
7         8        Aug  24600
8         9        Sep  24000
9        10        Oct  23950

In [43]:
# Now the index is unique, you can concat with 3rd dataframe
df_full = pd.concat([df_row, df3], axis = 1)

In [44]:
df_full

  serial_id sale_month  sales sales_threshold bonus_threshold
0         1        Jan  12300              No              No
1         2        Feb  25100             Yes             Yes
2         3        Mar  17800              No              No
3         4        Apr  20100             Yes              No
4         5        May  21000             Yes              No
5         6        Jun  25000             Yes             Yes
6         7        Jul  23700             Yes              No
7         8        Aug  24600             Yes             Yes
8         9        Sep  24000             Yes             Yes
9        10        Oct  23950             Yes              No